[
    {
        "id": 1,
        "image": "https://www.globalbrand.com.bd/image/cache/catalog/VENTION/VENTION%20NBNB0%20ANC%20True%20Wireless%20Bluetooth%20Earbuds-600x600.webp",
        "title": "Wireless Bluetooth Earbuds",
        "description": "These wireless Bluetooth earbuds are designed for comfort and high-quality sound. They feature advanced noise-cancellation technology, allowing you to enjoy your music without outside distractions. The ergonomic design ensures they fit snugly in your ears for long listening sessions. With up to 24 hours of battery life, you can use them all day without worrying about charging. The compact charging case makes it easy to carry them wherever you go. They are sweat- and water-resistant, making them perfect for workouts and outdoor activities. Bluetooth 5.0 provides a strong and stable connection with low latency. Built-in touch controls let you manage calls and music easily. The sleek, modern design adds style to function. These earbuds are ideal for anyone who values both performance and convenience.",
        "price": 2100
    },
    {
        "id": 2,
        "image": "https://www.siatex.com/wp-content/uploads/2022/12/Multicolor-Men-Reflective-Striped-Cut-And-Sew-Tee-Casual-T-shirts.jpeg.webp",
        "title": "Casual Cotton T-Shirt",
        "description": "This casual cotton t-shirt is crafted from 100% premium cotton fabric for maximum comfort. It is soft, breathable, and lightweight, making it perfect for everyday wear. The fabric is durable and designed to last through repeated washing. Available in a range of sizes and colors, it suits both men and women. Its classic round-neck design complements any casual outfit. The stitching is strong and reinforced to prevent wear and tear. It absorbs moisture well, keeping you fresh throughout the day. Pair it with jeans, shorts, or trousers for a versatile look. The t-shirt has a smooth finish that feels comfortable against your skin. It is an essential wardrobe item for those who value comfort and style.",
        "price": 650
    },
    {
        "id": 3,
        "image": "https://storage.googleapis.com/pickaboo-prod/media/catalog/product/cache/90e3b9f4120fc209bf60003e3b0e1323/x/-/x-watch-1-pro-24-11-24.jpg",
        "title": "Smartwatch Pro X",
        "description": "The Smartwatch Pro X combines technology and style into one powerful device. It tracks your steps, calories, and workouts with high precision. The built-in heart rate monitor and sleep tracker help you stay on top of your health. Notifications from calls, texts, and apps are delivered straight to your wrist. It is water-resistant, so you can wear it while swimming or showering. The battery lasts up to a full week on a single charge. The touch display is bright, clear, and easy to navigate. Multiple watch faces allow you to customize its appearance. Made with durable materials, it can withstand daily wear and tear. It is the perfect blend of fashion and technology for modern lifestyles.",
        "price": 4950
    },
    {
        "id": 4,
        "image": "https://m.media-amazon.com/images/I/71yPjRq-gjL._AC_SL1200_.jpg",
        "title": "Genuine Leather Wallet",
        "description": "This genuine leather wallet is both stylish and practical. It is made from top-grain leather that ages beautifully with use. The wallet features multiple card slots for easy organization. A dedicated section for cash and receipts keeps everything in place. It includes a transparent ID window for convenience. The RFID-blocking technology protects you from electronic theft. The stitching is fine and durable for long-lasting use. Its slim profile makes it easy to carry in your pocket. The design is classic, suitable for both casual and formal occasions. It is a perfect accessory for anyone who appreciates quality craftsmanship.",
        "price": 975
    },
    {
        "id": 5,
        "image": "https://www.startech.com.bd/image/cache/catalog/mouse/xigmatek/g1-gaming/g1-gaming-500x500.webp",
        "title": "RGB Gaming Mouse",
        "description": "This RGB gaming mouse is built for gamers who demand precision and speed. It features a high-DPI optical sensor for accurate tracking. The ergonomic design fits comfortably in your hand during long sessions. Customizable RGB lighting gives your setup a vibrant look. Programmable buttons allow you to map controls for quick actions. The braided cable ensures durability and prevents tangling. It has adjustable DPI settings to suit different game genres. The scroll wheel is textured for better grip and control. Compatible with both Windows and Mac, it is easy to set up. This mouse is an essential tool for casual and competitive gamers alike.",
        "price": 1350
    },
    {
        "id": 6,
        "image": "https://www.vibrantbd.com/cdn/shop/files/82460351_ba991643-33b6-49e6-8e05-4943304b49cd.jpg?v=1730029953",
        "title": "Men's Formal Leather Shoes",
        "description": "These men's formal shoes are crafted from high-quality leather with a polished finish. They feature a cushioned insole that provides all-day comfort. The slip-resistant outsole ensures stability on different surfaces. A timeless design makes them suitable for office wear or special occasions. Hand-stitched details add elegance and durability. The shoes are designed to maintain their shape even after years of use. The breathable lining keeps your feet cool and comfortable. They pair well with formal trousers or suits. Available in multiple sizes for a perfect fit. These shoes combine style, comfort, and durability for the modern gentleman.",
        "price": 3100
    },
    {
        "id": 7,
        "image": "https://www.gadstyle.com/wp-content/uploads/2024/06/bange-bg-2950-laptop-backpack-business-travel-big-capacity-15-6-5.webp",
        "title": "Laptop Backpack",
        "description": "This laptop backpack is designed for students, travelers, and professionals. It features a padded laptop compartment for extra safety. The water-resistant fabric protects your belongings in all weather. A built-in USB charging port allows you to charge devices on the go. The adjustable straps provide comfort for long commutes. Multiple compartments help organize books, gadgets, and essentials. Its lightweight design reduces strain on your back. The zippers are smooth and long-lasting. With a modern and sleek appearance, it complements any outfit. This backpack is both practical and stylish for everyday use.",
        "price": 2400
    },
    {
        "id": 8,
        "image": "https://images.othoba.com/images/thumbs/0942866_emoji-ceramic-mugs-for-coffee-tea-water-milk-cup-gift-1-piece-coffee-mug.jpeg",
        "title": "Ceramic Coffee Mug",
        "description": "This ceramic coffee mug adds charm to your daily routine. It is made from high-quality ceramic that keeps drinks hot or cold longer. The matte finish gives it a premium and elegant look. The handle is designed for a comfortable grip. Its 350ml capacity is perfect for coffee, tea, or other beverages. The mug is dishwasher and microwave safe. It has a smooth glaze inside for easy cleaning. The design is minimal, fitting well in any kitchen or office. Available in multiple colors to suit your style. This mug is a practical yet stylish choice for any coffee lover.",
        "price": 320
    },
    {
        "id": 9,
        "image": "https://static-01.daraz.com.bd/p/900558a79eb774c5405bac146d2b06f1.jpg",
        "title": "Steel Water Bottle",
        "description": "This steel water bottle is eco-friendly and reusable. It is made from durable stainless steel that resists rust and stains. The double-wall insulation keeps drinks hot or cold for hours. A leak-proof cap prevents spills while traveling. The bottle is lightweight and portable. Its sleek design fits in most car cup holders. It is safe and BPA-free for everyday use. Easy to clean and maintain for long-term use. Suitable for gym, office, or outdoor activities. This bottle is the perfect replacement for disposable plastic bottles.",
        "price": 820
    },
    {
        "id": 10,
        "image": "https://cdn.shopz.com.bd/2024/02/WIWU-Razor-Untra-Light-Wireless-Keyboard-64-Keys-1.jpg",
        "title": "Wireless Keyboard",
        "description": "This wireless keyboard makes typing smooth and effortless. It connects easily via Bluetooth or USB receiver. The keys are silent and comfortable for long working hours. A slim profile saves space on your desk. It is compatible with laptops, desktops, and tablets. The keyboard includes function keys for quick shortcuts. It has a long-lasting battery that requires fewer replacements. The durable build ensures it can handle daily use. Lightweight and portable for easy carrying. A stylish accessory for both office and home setups.",
        "price": 1750
    },
    {
        "id": 11,
        "image": "https://www.joyroombd.com/wp-content/uploads/2025/03/VENTION-F12B0-True-Wireless-Bluetooth-Earbuds.webp",
        "title": "Wireless Bluetooth Earbuds",
        "description": "These wireless Bluetooth earbuds are designed for comfort and high-quality sound. They feature advanced noise-cancellation technology, allowing you to enjoy your music without outside distractions. The ergonomic design ensures they fit snugly in your ears for long listening sessions. With up to 24 hours of battery life, you can use them all day without worrying about charging. The compact charging case makes it easy to carry them wherever you go. They are sweat- and water-resistant, making them perfect for workouts and outdoor activities. Bluetooth 5.0 provides a strong and stable connection with low latency. Built-in touch controls let you manage calls and music easily. The sleek, modern design adds style to function. These earbuds are ideal for anyone who values both performance and convenience.",
        "price": 2100
    },
    {
        "id": 12,
        "image": "https://onesixeightlondon.com.au/cdn/shop/files/23065.full_grande.jpg?v=1692168108",
        "title": "Digital Alarm Clock",
        "description": "This digital alarm clock features a bright and clear LED display that makes it easy to read the time from across the room. It comes with a convenient snooze function, allowing you to catch a few extra minutes of sleep without missing your schedule. The built-in night light provides a gentle glow, perfect for nighttime visibility without disturbing your rest. Its compact design fits easily on any bedside table or desk. The alarm sound is adjustable, offering options for both gentle wake-ups and louder alerts. Easy-to-use buttons let you set the time and alarm quickly without confusion. Powered by reliable batteries, it ensures consistent performance even during power outages. The sleek and modern design complements any bedroom or office decor. Lightweight yet sturdy, it is durable and long-lasting. Overall, this alarm clock combines functionality, style, and convenience to help you stay punctual every day.",
        "price": 870
    },
    {
        "id": 13,
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT6PkGOMsKoNq6mjUnNDAo9qvupRcvUU1t3Uw&s",
        "title": "Sunglasses UV Protection",
        "description": "These stylish sunglasses offer full UV400 protection, shielding your eyes from harmful UVA and UVB rays. The sleek design makes them a perfect accessory for both casual and formal outfits. Lightweight and comfortable, they can be worn for hours without causing strain. The durable frame ensures long-lasting use, resisting everyday wear and tear. High-quality lenses reduce glare, making them ideal for driving, outdoor sports, or beach outings. The contemporary shape suits most face types, adding a fashionable touch to your look. Scratch-resistant coating keeps the lenses clear and pristine. These sunglasses are easy to clean and maintain, ensuring they always look brand new. They come in a variety of colors to match different personal styles. Overall, they combine eye protection, comfort, and elegance for daily outdoor activities.",
        "price": 1050
    },
    {
        "id": 14,
        "image": "https://mygirlco.com/writable/uploads/filemanager/source/Flormar/other/Colour_me/4_Colour%20me%20_Red_%20perfume/9_8f7a9088-5d1a-40d2-982e-764a76c12314_1800x1800.jpg",
        "title": "Women's Perfume 50ml",
        "description": "This women's perfume features a long-lasting floral fragrance that lingers throughout the day. Its delicate blend of notes creates a refreshing and elegant scent. The 50ml bottle is compact and travel-friendly, perfect for carrying in your bag. The perfume is ideal for everyday use or special occasions. Designed to complement various moods, it offers both freshness and sophistication. The fragrance is carefully formulated to be gentle on the skin. A luxurious bottle design makes it a stylish addition to your vanity. Its aroma leaves a memorable impression wherever you go. Lightweight yet powerful, a few sprays are enough to last hours. Overall, it is a perfect combination of elegance, charm, and long-lasting freshness.",
        "price": 2250
    },
    {
        "id": 15,
        "image": "https://richmanbd.com/wp-content/uploads/2025/06/6a-600x600.jpg",
        "title": "Men's Polo Shirt",
        "description": "This premium cotton polo shirt is made with soft, breathable fabric for maximum comfort. Its classic design suits casual outings as well as semi-formal events. The lightweight material allows air circulation, keeping you cool all day. Durable stitching ensures long-lasting wear without fraying. The shirt features a tailored fit that enhances your silhouette. Easy-to-care-for fabric allows machine washing without damage. Available in various colors, it matches easily with different pants or shorts. The collar and buttons add a stylish, sophisticated touch. It is ideal for daily wear, office meetings, or weekend gatherings. Overall, it combines style, comfort, and durability for the modern man.",
        "price": 1250
    },
    {
        "id": 16,
        "image": "https://i5.walmartimages.com/seo/TARION-Tripod-Phone-Camera-Stand-50-6-Mobile-Selfie-Lightweight-Travel-Clamp-Carry-Bag-Ring-Light-Cell-Video-Recording-Filming-Live-Stream-Aluminium_58d8ecd0-edb5-450c-8f32-df49927bf9fd.aeafe3ec8b1cb95e066f09f6f35747bf.jpeg",
        "title": "Tripod Stand for Mobile",
        "description": "This adjustable tripod stand is perfect for photography and video shooting. It supports multiple angles, giving you flexibility for different shots. The sturdy design ensures your mobile device stays secure and stable. Lightweight and portable, it is easy to carry for outdoor shoots or travel. Its telescopic legs allow height adjustments for optimal framing. Quick setup and folding make it convenient for busy schedules. The non-slip feet prevent accidental tipping on smooth surfaces. Compatible with most smartphones, it works with selfie sticks and phone mounts. It is ideal for vlogging, live streaming, or capturing family moments. Overall, it provides convenience, stability, and professional-quality support for mobile photography.",
        "price": 980
    },
    {
        "id": 17,
        "image": "https://www.ryans.com/storage/products/main/havit-f2083-black-laptop-cooling-11725516674.webp",
        "title": "Laptop Cooling Pad",
        "description": "This silent laptop cooling pad features multiple fans to enhance airflow and prevent overheating. Its ergonomic design raises your laptop for better typing comfort. The fans operate quietly, ensuring minimal distraction during work or gaming. Lightweight and slim, it is easy to carry with your laptop. Adjustable height settings provide optimal cooling and viewing angles. The pad is compatible with most laptop sizes, offering versatile use. Built-in USB ports allow convenient connectivity for other devices. The durable construction ensures long-term performance and reliability. Its modern design complements any workspace or home setup. Overall, it helps improve laptop performance, extends device life, and provides a comfortable working experience.",
        "price": 1650
    }
]